app/Controllers/Pesanancontroller.php

    public function index()
    {
        $data['data'] = $this->menu->select('id,nama')->findAll();
---
SELECT `id`, `nama`
FROM `tb_menu`